{
  "HSRMod:StelleAwake": {
    "NAME": "Choose your path",
    "OPTIONS": [
      "[Elation]",
      "[Destruction]",
      "[Nihility]",
      "[Preservation]",
      "[Propagation]",
      "[The Hunt]",
      "[Erudition]",
      "[Abundance]",
      "[Remembrance]",
      "[Trailblaze]",
      "[Begin Journey]"
    ],
    "DESCRIPTIONS": [
      "",
      "~Are~ ~You~ ~Ready~ "
    ]
  },
  "HSRMod:RuanMei": {
    "NAME": "Ruan Mei",
    "OPTIONS": [
      "Who are you?",
      "Are you another puppet of Herta's?",
      "What is this place?",
      "[continue]",
      "What's the difference between your code and Herta's?",
      " Both of you like to pull off little tricks",
      "[Worship Aeons] #gUpgrade all cards",
      "[Want lots of money] Gain #y1200 gold",
      "[Steal goodies from Herta] Obtain #b6 relics",
      "[You are... Ruan Mei?] Trigger 2 effects above",
      "[LOCK] Needs A-Ruan Pouch. ",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You catch a whiff of the aroma of warm pastries. Your eyes fall on a bean pastry adorned with Startled Deer petals. NL You continue to trace the source of the aroma. As you look up, you find a dark-haired lady standing in front of you. You can smell the residual aroma on her lips while she licks the bits of pastry stuck on her fingers.",
      "\"I nurtured this miniature slice by myself and embedded it into the code of the Simulated Universe.\" She strokes the embroidery on her scarf distractedly as she adds, \"Don't tell Herta and Screwllum about this.\"",
      "\"Herta invited me to participate in this project and nurture the universe.\" She shakes her head. \"I'm different from her. Although we appear like the best of friends in many aspects... the truth is, we aren't that close with each other.\"",
      "\"This is the simulated lab, my miniature petri dish.\" She says with a frown.",
      "\"Herta has a thing for inventing quirky systems and gadgets, while I nurture the prototypes of the universe and the Aeons.\" She answers.",
      "\"The chance of breaching into my slice is slim, so you should be happy about this. I'll give you some things,\" she says, \"good things. But they don't come for free.\""
    ]
  },
  "HSRMod:CosmicCrescendo": {
    "NAME": "Cosmic Crescendo",
    "OPTIONS": [
      "[continue]",
      "[Listen] Trigger 10 random effects in a row.",
      "[Don't listen] Don't listen to bewitching songs...",
      "[Join the choir!] Trigger 15 random effects in a row.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "One day, a fan of a major rock star hands you a soundtrack album he has kept for a long time. There are dozens of different voices inside. NL \"The noisiest rock music, the most sacred classical rap, the trendiest retro elements, and the most vibrant basic musical ornaments! This precious album showcases the instrumental piece of cosmic trendy toys and food and the latest social deduction game, with a mixture of elements across the ages!\" NL Feeling annoyed, you are certain he is a member of the Contradictory Element Organization!",
      "You #ggained %d gold.",
      "You #rlost %d gold.",
      "You #ggained #y%s .",
      "You #rlost #y%s .",
      "Your %s has upgraded.",
      "Your %s has transformed.",
      "Your health is #gheal by %d.",
      "You #rlost %d health.",
      "Nothing happened.",
      "The song is over."
    ]
  },
  "HSRMod:IOUDispenser": {
    "NAME": "I.O.U. Dispenser",
    "OPTIONS": [
      "[I'll buy it] Gain Angel-type I.O.U Dispenser",
      "[I don't need it] Gain #y%d gold",
      "[Claim an investment] Gain Angel-type I.O.U Dispenser and destroy it.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Madam Scarred Eye, board member of the IPC, sits across from you. A long and narrow scar cuts through her left eye. You can sense her gaze on you, and you know she is not to be trifled with. NL You are sitting here because of her overwhelming intimidation. A maid offers her a glass of champagne, and softly kisses the back of her hand. NL \"The planet Evelli is hit by a financial crisis,\" Madam Scarred Eye announces. \"To help them tide over, our Business Consolidation Department has launched the Angel-type I.O.U. Dispenser. I'll make you an irresistible offer.\" NL \"Buy the IPC's debt, wait for this catastrophe to be over, and the IPC will pay you an amount more than ten times your principal.\" NL The servant next to Madam Scarred Eye pushes out a robot angel with wings. \"This is the Angel-type I.O.U. Dispenser. You need to feed Gold Coins into it regularly, and it will keep a record of your investment. At the end of the investment term, it will pay you an amount more than ten times your principal.\"",
      "~Thanks~ ~for~ ~coming~~"
    ]
  },
  "HSRMod:Tavern": {
    "NAME": "Tavern",
    "OPTIONS": [
      "[continue]",
      "[Expose his bankruptcy] Enter battle, gain a common relic after victory.",
      "[Expose him] Enter a harder battle, gain an uncommon relic after victory.",
      "[Fight both together!] Gain a rare relic after victory.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You reach an Elway-style tavern with a lively atmosphere. NL You order a cocktail concocted with Marian oranges and palm cinnamon. Then, you observe the crowd. Everyone is wearing a mask and has different body sizes. From this, you know it is a tavern where the Masked Fools gather. NL \"Welcome to Tavern World's End.\" Bragi, the bartender, bows deeply to the patrons and continues, \"We only serve customers with a sense of humor.\"",
      "\"In keeping with Aha's will, we will have some fun next. Mr. France and his team of bodyguards will be the next to join the arena. His opponent will be Avila. He and his mercenaries are burly and not to be underestimated!\" NL \"Who else is coming? Who's up for the 78,201st round?\"",
      "You #ywon."
    ]
  },
  "HSRMod:RockPaperScissors": {
    "NAME": "Rock, Paper, Scissors",
    "OPTIONS": [
      "[continue]",
      "[Fight for the 0.63% chance] #rEnter #rbattle",
      "[Pick the 100% security] Lose #y100 gold",
      "[Sense the vulnerabilities] #rEnter #ra #rharder #rbattle, gain one more card reward and upgrade them.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "The astral computer before you, with a curved screen on top and a genderless human body at the bottom, is running a calculation at a high speed. While it seems to be simulating the collapse of a massive star, only you know that you are playing a game of rock-paper-scissors with it. NL \"There is an 82.49% chance of you playing rock in the first game, and a 94.61% of you playing scissors in the second. ",
      "If you choose to flip the table with me and battle with the monsters I created, there is a 99.37% of you losing.\" NL \"But if you leave some gold behind, your chance of survival is 100%.\" It is waiting for your response.",
      "You left some gold behind.",
      "You #ywon."
    ]
  },
  "HSRMod:WaxManufacturer": {
    "NAME": "Sealing Wax Manufacture Machine",
    "OPTIONS": [
      "[Wax Blessing] Get a card from all uncommon cards of current path",
      "[Purchase Wax] Get a more suitable wax.",
      "[Wax Enhancement] Upgrade #b3 cards of current path",
      "[Wax Casting] Gain a suitable path relic",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You look at the scene before you: It is raining in the Black Forest, and there are dew drops on every leaf. The rain saddens you. NL You wander around in the Black Forest amid the drizzle and arrive at a blacksmith's store by the roadside. A machine is immersed in churning out sealing wax and hammering away in full concentration until your presence interrupts its work. NL \"Do you want to ask me about the sealing wax?\" It has a penetrating gaze.",
      "\"I'll still be making sealing wax here for another 100 years,\" the manufacturing machine says, and then gets back to its hammer.",
      "Select a card to obtain"
    ]
  },
  "HSRMod:LonelyBeautyBugsOne": {
    "NAME:": "Loneliness, Cosmic Beauty Bugs, Simulated Universe (I)",
    "OPTIONS": [
      "[continue]",
      "[Feed salt nack] #rlose #b1 random non-starter relic",
      "[Use cleaning foam] #rlose #b1 random card",
      "[Feed milk tea] Lose #y100 gold",
      "[Take care] This is how you treat your friends.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Despite having traversed the Simulated Universe for eight million miles, you did not find anyone who truly understood you... NL You are tired of continuously testing one project after another. So, you decide to adopt a worm as your companion in the Simulated Universe.",
      "ou observe your companion: This beautiful space worm is named Sweet Saliva. It secretes secondary metabolites around its wound that give off a unique flowery, fruity, and sweet scent... You know that when it matures, it will linger around the exotic fruit orchards and cosmic tea plantations. Each of its trips may bring the scent of *love* to you. NL Although you are destitute... you can still do your best to nurture it.",
      "Your space worm wriggles and spurts a mouthful of saliva at your face to show its gratitude to you. NL Oh... You feel so happy!",
      "Your space worm is wriggling. You wait for it to spurt a mouthful of saliva at your face... NL However, it leaps and smacks its tail against your face instead! It hurts a lot! NL ...Seems like it hates to be treated this way."
    ]
  },
  "HSRMod:LonelyBeautyBugsTwo": {
    "NAME:": "Loneliness, Cosmic Beauty Bugs, Simulated Universe (II)",
    "OPTIONS": [
      "[continue]",
      "[Accept the \"Heartfelt Gift.\"] Obtain #b3 random common relic",
      "[Accept the \"Life's Favor.\"] Obtain #yOrrery",
      "[Accept the \"Propagation's Honor.\"] Obtain #b1 random #rboss relic",
      "[Refuse] You just want to keep giving... You don't expect anything in return at all.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Time flies. The space worm named Sweet Saliva that you have nurtured has been undergoing immersive learning at the cosmic tea plantation for a long time... When you hear the sound of fumbling at the door, you know it is back. NL You open the door and find that it has grown up. Its skin, which was initially green, has faded and is now covered by a colorful pattern that is a mixture of white, yellowish green, and brownish blue hues...",
      "They are the signs that Sweet Saliva has matured into an adult bug. It calls out for you... which is the proof of its *love* for you.",
      "A relieved and sorrowful smile breaks out on your face."
    ]
  },
  "HSRMod:SlumberingOverlord": {
    "NAME": "Swarm: Slumbering Overlord",
    "OPTIONS": [
      "[continue]",
      "[Leave immediately] Lose #r20% health",
      "[Kill them] Enter #rbattle, gain Intersection Membrane",
      "[Tidy things up] Enter #rbattle, gain Excitatory Gland",
      "[Offer spore sacks] Get a Curse, get Plague Nest",
      "[Get your loot]",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Holding a syringe containing Metabolase, you stride toward the putrefied throne slowly and nervously... All it takes is a tiny dose deliver into the Swarm's fibers and...",
      "You pierce it with the needle! NL The dose wakes the Lord of Eternal Slumber up! It opens its eyes wide and starts drooling...",
      "\" @...█Hiss...██...█Hiss█...██...@ \"",
      "You know metabolism takes time... and you want to witness its completion! However, more and more Swarm larvae are coming! You must escape from them quickly...",
      "You #ywon.",
      "You offered your spore sacks to the lord.",
      "You obtained your loot."
    ]
  },
  "HSRMod:DoubleLottery": {
    "NAME": "The Double Lottery Experience",
    "OPTIONS": [
      "[continue]",
      "[Vote] Purchase a lotto relic using #y50 gold, and fix all lottos",
      "[Experience] Fix all lottos using #y25 gold",
      "[Refuse] You can't find happiness like that!",
      "[Hack] Destroy all the lotto, gain relic twice of lotto destroyed",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "he lottery distributor from the Interastral Peace Corporation's Fanaticism Department is here! NL \"Have you heard of the Double Lottery Experience?\" He whispers into your ear.",
      "\"I can provide you with... the Double Lottery Experience... as long as you vote for Oswaldo Schneider in the election.\" NL He looks at you with anticipation in his eyes.",
      "I want to vote for \"Oswaldo Schneider\"! NL You shouted",
      "I want to have the Double Lottery Experience! NL You shouted",
      "You refused the distributor's offer.",
      "You hacked into the \"code\" of the lotto series"
    ]
  },
  "HSRMod:ThreeLittlePigs": {
    "NAME": "Three Little Pigs",
    "OPTIONS": [
      "[continue]",
      "[Play a bit with Sequence Trotters] Enter combat with 3 #ySequence #yTrotters — Trot Prime, Trot Deuce, and Trot Tri.",
      "[Leave] A person shouldn't be on the same level as Trotters!",
      "[You pass on a good sense of safeguarding against Trotters] Trotters are slower.",
      "[Excellent Trotter-catching skills] Trotters are faster, upgrade all card rewards."
    ],
    "DESCRIPTIONS": [
      "Three timid sequence creatures that resemble a pig bump into you as you wander across the wilderness where the Hithradahn people dwell. They react differently to your presence: one is trembling, one is ready to flee, and one is in a combat position.",
      "You remember the description written in the Interastral Peace Guide. The creatures are called Sequence Trotters, and they are trans-latitudinal organisms. They spend most time of their lives eating and escaping. NL Running into a Sequence Trotter is an auspicious sign. You start to think of a way to deal with them. The rules of the game must be fixed according to the personality of each Trotter.",
      "The trotter catching game ended."
    ]
  },
  "HSRMod:ImperialLegacy": {
    "NAME": "Imperial Legacy",
    "OPTIONS": [
      "[continue]",
      "What happened next?",
      "Who is he?",
      "[Touch] There is a very low chance of receiving a response from the legacy.",
      "[Embrace] Gain 1 random #yRubert #yEmpire series relic.",
      "[Accept] Spend #y300 gold and gain 2 random #yRubert #yEmpire series relics.",
      "[ #bReturn ] Lose Rubert Empire Difference Machine. Obtains #y2400 gold, #y24 random relics, and upgrade 24 cards.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You find yourself on a nameless planet full of towering metallic structures. Among the ruins basked in faint sunlight, a massive, sophisticated machine slowly makes its way toward you. It picks up the parts scattered all over the ground and fixes them onto its fortress-like body in an orderly manner.",
      "The piston rises and falls, resulting in a vigorous lever effect that brings about the turning of the gears. The machine emits a deep growl as it mends its damaged body with little hope of completion.",
      "An old man approaches you with one-half of his arm drooping. The ancient Intellitron is unfazed by the peculiar scene before him. Using his last piece of visual crystal he has, he fixates his gaze upon you, an unexpected visitor, and nods approvingly.",
      "\"How nostalgic. Once, there was also an organic creature like you standing here, marveling at the lives created by the emperor.\"",
      "\"How could I possibly remember?\" The ancient Intellitron shakes his head, and a string of chewed cables falls out along with several oxidized chips engraved with the crest of the Rubert Empire. \"They say I'm broken, just like this kid here.\"",
      "The dreadful steel fortress comes to a halt behind the old man. Its gears grind against each other non-stop, producing an odd noise. It seems to be responding to the old man's commands.",
      "\"The emperor's legacy isn't only available for inorganic creatures. If you can free yourself from your current shackles... it will guide you in the right direction.\" A faint crimson light flashes in the Intellitron's eyes. His words send ripples of resonance in your consciousness like a spell.",
      "The battered moving fortress glides past the top of your head. Your heart almost stops beating because of the enormous roar.",
      "By the time you snap out of your trance, the ancient Intellitron has gone far with the machine, leaving behind tire tracks on the ground.",
      "The colossal metal behemoth has not responded to your expectations. However, there is no need to rush because one day, the successor to the Empire will come here.",
      "A grand formula unfolds in your mind. Cold data permeates your perception, waiting for subtle changes to take place in the future.",
      "The old man takes a part from the metal behemoth. The part moves closer to the rest of the parts surrounding you in apparent eagerness. Amid their resonance, you seem to discern the lingering voice of the Emperor Rubert.",
      "The old man takes two parts from the metal behemoth and hands them over to you solemnly. A plethora of equations alters your cognition, their intense reverberations causing your head to split.",
      "The old man stares at you blankly, his obsolete logic chip unable to comprehend your actions. With his hands trembling, he takes the difference machine from you, looking just like an ordinary, despondent citizen of a fallen kingdom."
    ]
  },
  "HSRMod:PineappleBread": {
    "NAME": "Pineapple Bread",
    "OPTIONS": [
      "[continue]",
      "[Choose Pineapple] Choose to remove #b%d cards, but gain negative relic: Pineapple.",
      "remove %d cards",
      "[Choose Bread] Nothing happens.",
      "[Take a drink] Obtain #b%d random subtle relic.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You sit on the hot sofa as the lights make you temporarily dizzy. The game of bravery: Pineapple Bread is approaching its final stages as everyone awaits your decision as the final survivor. NL NL \"There are two boxes left. Eat the pineapple and take the prize or eat the bread and get lost.\" The manic faces of the audience are reflected in the host's compound eyes — They don't want to see you win. They want to see you fail.",
      "There are over nine thousand objects in the cosmos that go by the name of \"pineapple.\" Some are rocks, some are leaves, and some are even black holes. Until you open this box, no one knows what lies within. NL NL Your brain freezes as images of the last runner-up being evaporated by a plasma pineapple rush through your mind.",
      "\" #y@Pineapple@ or #y@bread!?@ \" The spectators impatiently spur you on.",
      "One doesn't get rich without taking risks! As you swallow the pineapple, a bitterness runs over your tongue.",
      "You become deeply aware of a great truth: That no matter how much money you have, you have to be alive to spend it.",
      "This program is sponsored by the Interastral Peace Corporation. Authentic pineapple soda, bringing you an unforgettable feast of flavor."
    ]
  },
  "HSRMod:TrashSymphony": {
    "NAME": "Trash Symphony",
    "OPTIONS": [
      "[continue]",
      "[Never turn my back on humanity] Enter a battle against trashcans, gain #b2 relics after victory.",
      "[I am the king of trashcans!] Enter battle against Rumbas the Third, gain #b2 destructible relics after victory.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You enter the underground stronghold of the Rumbas system. A large number of weapons and trashcans fall from the production pipeline. Rumbas the Third rides atop his horse, displaying his authority that rivals Tatalov, undiminishing and ever-burgeoning. NL NL For a long time, trashcans have endured unequal treatment. They are treated as mere tools of humanity, devoid of dignity. NL NL Rumbas the Third raises his arm and shouts. He demands power, power to freely access organic and recyclable waste. He vows to lead an army of trashcans to dominate the universe and become the master of all realms.",
      "Rumbas the Third's gaze falls on you. \"The hero who defeated Tatalov... You are different from other inferior humans. I will give you a chance.\" NL NL Will you kneel before Rumbas the Third and accept the emperor's honors, or swear loyalty to the human race to which you belong and continue to oppress the trashcans?",
      "Rumbas the Third respects your choice. He fakes his sadness as he summons his cloned trash kin, instructing them to give you a \"dignified\" end.",
      "A mere trashcan dares to order you around? You swing your bat and charge at Rumbas the Third, ready to snatch this emperor's perch.",
      "You #ywon."
    ]
  },
  "HSRMod:AceTrashDigger": {
    "NAME": "Ace Trash Digger",
    "OPTIONS": [
      "[continue]",
      "[Even trash has its unique \"value\"...] #yGain #b3 destroyed relics。",
      "[Toss your trash in!] #rLose #b1 normal relic， #yGain #b2 random relics.",
      "[leave] You are not interested the trashcans.",
      ""
    ],
    "DESCRIPTIONS": [
      "A person carrying a trashcan meets you. He crouches down and shows you his treasured trashcan. NL NL \"This is an incredulous space.\" He beckons. Then, he tosses out some collections of pitiful love poems from the trashcan to make some space for you. NL NL In a hushed voice, he says, \"Put your waste in it, and the items will evolve into an advanced awareness, then come running out energetically on their own!\"",
      "Who can deny a brand new Trash?"
    ]
  },
  "HSRMod:CulinaryColosseum": {
    "NAME": "Culinary Colosseum",
    "OPTIONS": [
      "[continue]",
      "[Come at me all at once] Enter battle, gain #b2 random relics after victory.",
      "[Throw trash into the opponent's can] Enter battle, remove #b%d cards after victory.",
      "[Challenge the jury] Enter battle, gain #b3 destructible relics after victory.",
      "[Claim reward]",
      "[leave]",
      "Choose to remove  cards"
    ],
    "DESCRIPTIONS": [
      "Walking into the recycling station on the Rumbas system, you hear thousands upon thousands of trash dumps cheering from inside the garbage pile. NL NL As ring master of the 21st Garbage Chef Championship, you view the observation shield, half-eaten Halovian Winged Burgers, currency from an unknown system, as well as the garbage thrown from the audience instead of flowers, as an expression of their hopes for you.",
      "You casually glance around at the challengers: Tatalov's palace chef, Erolyn, the molecular eater Risaac, who's tasted a thousand kinds of garbage, and the world-famous garbage gourmand Jacques Feaux. Every one of them is a demanding prospect. NL NL And yet, in your mind, the menu for victory has already been decided.",
      "You've got guts! After hearing what you have to say, three fighters get ready to fight and decide to express their respect for you at the highest level.",
      "\"Whoa... boo!\" jeer the audience as the challengers grow furious, preparing to teach you a lesson.",
      "\"Wow, what an arrogant youngster.\" Several referees jump forth, and the audience wipe their lids clean — preparing to witness an epic showdown in the world of garbage cuisine.",
      "You #ywon.",
      "You got what you deserved."
    ]
  },
  "HSRMod:YuQingtu": {
    "NAME": "Genius Society #55 Yu Qingtu",
    "OPTIONS": [
      "[continue]",
      "Add sugar.",
      "Add toothpaste.",
      "[Elation] You decide to add more weird stuff to it...",
      "[Nihility] A glass of wine should learn to swirl itself.",
      "Stir gently...",
      "Stir vigorously!",
      "Give in to the sleepiness...",
      "First, take care of the unfriendly eyes around you!",
      "[Deal with the mutant] Enter battle, and gain 1 rare card after victory.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You arrive at a strange restaurant in outer space. In the building built with red bricks, there are some Bavirus, foxians, and humans. There is even a Diting sitting at a long table. NL NL Yet, some exiles dressed in gray prisoners' robes are here too... The sight of the shackles on their feet makes you shudder. You bypass them and walk to the bar with its comparative safety.",
      "\"We specialize in exotic cocktails.\" The waiter speaks in an odd tone. \"Out of all the cocktail recipes left by Genius Society #55 Yu Qingtu, only 25 of them have been passed down to this day. Three of them are available here, but we can't guarantee whether those involve her toxic concoctions. Which one would you like?\" NL NL You start to doubt the waiter's professionalism.",
      "It's time to stir it.",
      "You receive a glass of cocktail! You gulp it down...",
      "Your cocktail explodes in front of you! NL NL You gain nothing, in addition to being blasted out of the restaurant by this strong force.",
      "You're badly injured.",
      "You receive a glass of cocktail! You gulp it down... Soon, a wave of lethargy hits you. NL NL As you are feeling drowsy, you notice a mischievous *thief* sizing you up slyly from the other end of the long table... She seems to have no qualms about openly showing her evil intentions.",
      "You fail to resist the urge to sleep... By the time you wake up, the thief with her dazzling eyes is already gone. NL NL Your wallet is no longer stuffed, and you have lost lots of gold... You hope to run into her again.",
      "You have finished stirring your cocktail. A lady in a sequined dress with a sensuous gaze suddenly walks over. The gems on her earrings sparkle under the lights, and you are bedazzled. She grabs the cocktail from your hands but still waves at you with a provocative smile. NL NL While you are still experiencing outrage at her action, she suddenly lets out a shrill cry, and her body curls up in a horrifying manner... You stagger a few steps backward.",
      "You are shocked by the recipe of Genius Society #55, Yu Qingtu. As it turns out, you have made a legendarily toxic cocktail...",
      "You #ywon."
    ]
  },
  "HSRMod:IPMBShoppingMall": {
    "NAME": "Interastral Peace Mechanical Branch Shopping Mall",
    "OPTIONS": [
      "[continue]",
      "Ambergris Cheese",
      "Casket of Inaccuracy",
      "Fruit of the Alien Tree",
      "Level up your Cognition",
      "Recycle all items above with 200 gold each.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You arrive at the docking bay of the Freon Mechanical Alliance. It is a vast harbor with mechanical attendants everywhere. NL NL A mechanical attendant leads you up a staircase, which you notice is formed by numerous mechanical arms. You keep going until you leave the harbor and see the sign of \"Interastral Peace Mechanical Branch Shopping Mall.\"",
      "The place is renovated in a style very much iconic to the IPC... You walk up to the counter. NL NL \"We sell our stuff cheaper at the port. That's it.\" The mechanical staff doesn't bother to explain too much — a signal for you to make your own choice.",
      "You gained what you want."
    ]
  },
  "HSRMod:RobotSalesTerminal": {
    "NAME": "Robot Sales Terminal",
    "OPTIONS": [
      "[Purchase #y%s] Cost #y%d gold.",
      "[Remove 1 card] Cost #y%d gold.",
      "[You recall \"bargaining technique.\"] Fix 2 destroyed relics.",
      "[Leave] You don't want to buy anything.",
      "[leave]",
      "Remove 1 card"
    ],
    "DESCRIPTIONS": [
      "You see an adorable robot waving at you. When you get near it, it speaks: \"This is an IPC point of sale! You can find everything you desire here!\" On the menu, you see medical, enhancement, and purchasing services offered at affordable prices...",
      "~Thanks for your purchasing~~"
    ]
  },
  "HSRMod:TheRelicFixer": {
    "NAME": "The Relic Fixer",
    "OPTIONS": [
      "[Repair a damaged relic] Cost #y%d gold.",
      "[Repair all damaged relics] Cost #y%d gold.",
      "[Make all inorganic life fall for you] gain a destructible relic。",
      "[Have a pleasant inorganic exchange] replace all uncommon relic to be destructible relics.",
      "[leave] You don't need it.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You meet a mechanical lifeform. It seems to be skilled in repairing Curios. NL \"Click... Click...\" NL It gestures for you to let it repair your treasures.",
      "Click... Click... NL NL It gives the relics carefully, expecting you to treat them carefully as well..."
    ]
  },
  "HSRMod:WeAreCowboys": {
    "NAME": "We Are Cowboys",
    "OPTIONS": [
      "[Pay] Lose #y50% of your gold.",
      "[Protect the cowboy's final honor] Enter battle.",
      "[Surrender immediately] Lose #y25% of your gold, gain #b2 #pNihility cards.",
      "[Let them experience the real \"cowboy.\"] Enter battle, to seize #y100 gold.",
      "[Make a \"trade\" with them] Lose #y50% of your gold, upgrade 4 random cards.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You are grazing grass on the sun-baked earth when a bunch of beefy guys comes your way. They are the street bandits who wreak havoc wherever they go. They are followed by a team of mercenaries. NL \"We're the last cowboys!\" Shouts the leader who flails his arms happily. The red ibis armbands indicate their submission to the royal family. You believe they are the royal bandits. NL \"Leave your gold coins behind. We need funds to oil the development of the city. Generosity is in line with the cowboy's spirit!\" Scowling at the shameless bandits, you bite off the grass with your mouth...",
      "You lost some gold.",
      "You gain what you want."
    ]
  },
  "HSRMod:InsectNest": {
    "NAME": "Insect Nest",
    "OPTIONS": [
      "[continue]",
      "[Stop at the entrance] Don't bet hastily",
      "[Go deeper]",
      "[Hug it] Gain #yInsect #yWeb , gain 1 #bRare card.",
      "[Wait for \"THEM\"] Lose #b20% of your current health, gain 1 #bUncommon card.",
      "[Save a Bug Bubble] Gain #pPropagation and #yPreservation cards.",
      "[Snuff them out!] Enter battle, gain 2 extra cards after victory.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You accidentally step into a ground trap made of branches and leaves — the type you believe to be used only by the most old-fashioned hunter on planet Bled. You get to your feet, and the entrance of a nest is before you.",
      "You believe your life doesn't need adventures... More importantly, you dread to face Tay█zzy█ ██ro█n█ █th██'s █ █childre███ ████... NL You have obtained some gold.",
      "Slowly, you make your way into the insect nest. As you brush off the eggs hanging upside down from the roof, you discover to your amazement that newborns within the translucent egg sacs are scratching their still unopened compound eyes with their antennae. NL You find an astonishing sight at the end of the nest. On a throne atop a pile of hundreds of \"egg sacs,\" \"THEY\" are sleeping soundly.",
      "A day passes when you blink once. You feel you are looking at the sleeping form of Tayzzyronth, the Imperator Insectorum, over and over, hoping that THEY will open THEIR eyes and look at you. NL The first egg sac softly ruptures, and new life blooms.",
      "When you lift the flat, round-shaped egg sack with your hands, its nutrients leak out like a punctured green cell. Then, it wriggles its curved body into your skin.",
      "Soon, a voice begins to ring in your head... Tay█zzy█ ██ro█n█ █th██... The long wait destroyed you, and you flee in a hurry.",
      "You saved a Bug Bubble."
    ]
  },
  "HSRMod:FleaMarket": {
    "NAME": "Flea Market",
    "OPTIONS": [
      "[continue]",
      "[Describe a colorful journey] Submit cards.",
      "[Describe a wondrous adventure] Submit relics.",
      "[Describe a simple life] Submit gold.",
      "[Bounty Hunter of the Snow Plains] Lose #y%s, gain #y%d gold.",
      "[Aha Stuffed Toy asking to be hit] Lose #y%s, gain #b%d destructible relics.",
      "[The library's History Fictionologist] Lose #y%s, gain 1 card from #b%d #yRare cards.",
      "[A primordial, bloodthirsty beast] Lose #y%s, gain #y%d gold.",
      "[A cooking Lordly Trashcan] Lose #y%s, gain #b%d cards.",
      "[Rock, Paper, Scissors with the calculator] Lose #y%s, gain #b%d path relics.",
      "[Last night's dream] Lose #y%s gold, remove #b%d cards.",
      "[Pom-Pom's tail] Lose #y%s gold, gain #b%d relics.",
      "[Himeko's coffee] Lose #y%s gold, max HP + #g%d, heal all HP.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You find yourself in a shattered memory bubble as the once-an-Amber Era galactic flea market reaches its peak period. Here, you don't even need to project a holographic goods shelf or use credits. If you see something you like, you can simply swap goods for other goods. NL Countless ships, their shadows numerous enough to cover the sky, don't even have a chance to dock before they find themselves under new ownership. The habitual ascetics, the Bretadens, also find themselves scouring every surface of their bodies for things that they could possibly trade.",
      "You come across a bearded poet that shows you an ancient pouch stuffed full of the cosmos' memories. NL \"A story. Please tell me a story. Fact or fiction is fine.\" Says the poet. \"Then, I shall take your verses, and you shall receive my song.\"",
      "Deals are mutually beneficial. The higher the price you pay, the more you should expect to receive. The poet looks at you with excitement, awaiting the story you will share.",
      "The poet slightly closes his eyes as you sink into a lonely ocean. The notes are the drops of water, the song is its flow and the story follows the rhythm of the waves into your chest. NL You see a dance that never stops, actors weeping on a gondola, and a rain of diamonds falling from the sky. When the hustle and bustle returns to your world, the poet is nowhere to be seen. Just as he said, he had taken your verses."
    ]
  },
  "HSRMod:ApesSuchAsYou": {
    "NAME": "Apes Such As You",
    "OPTIONS": [
      "[continue]",
      "[Safe and gentle caresses] Pet its head.",
      "[You need to be able to take risks] Smooth out the fur on its hair.",
      "[I have a dangerous idea!] Poke its belly.",
      "[Leave wildlife alone] Leave this place.",
      "[Gain nothing]",
      "[Something stuck on its fur] Gain #y%d gold.",
      "[Something hidden in its fur] Gain 1 relic.",
      "[Found the Gray Ape's secret stash of money] Gain #y%d gold and 1 relic.",
      "[Gray Ape's attacks are super effective] Lose #r%d%% of your current HP.",
      "[Resistance is futile!] Battle, reward: #y%d gold and 1 relic.",
      "[leave]",
      "[Enter battle]"
    ],
    "DESCRIPTIONS": [
      "You find a young ape lounging lazily on a rock. Its dense fur soaks in sunlight and sways in the wind like waves on a grassy plain. NL The ape leisurely rolls over, its natural muscle contours tracing an untamed silhouette with perfect curves that make even the Intelligentsia Guild mathematicians drool. NL And that tail... it is jauntily swaying in the air, soft and comfy, like it is its own entity. It moves with a mind of its own in orderless chaos, as mesmerizing as a Lodell oscillator model.",
      "The purity of nature, the simplicity of science — evolution has generously gifted both of these traits into one creation. You silently sidle close to this ape, your wriggling fingers barely able to suppress the excitement threatening to boil over in your heart.",
      "The ape doesn't reject your touch. The fur on its head isn't too thick, but has the suppleness of a river stream. It actively rubs against the palm of your hand, cooing in an affectionate tone. NL \"Heh-heh, my fluffy.\" You scratch its chin. The ape curls into a ball, wrapping your entire body in a world of heavy fur, its tail whimsically twirling in the air.",
      "Your fingers lightly glide across the trail of fur and reach the ape's tail — it is soft to the touch, and its reflexive twitches in an attempt to escape your grasp evoke an inexplicable thrill within you. NL \"Heh-heh, my floofy floof.\" It stares at you, somewhat confused, but very quickly abandoning all thought. The ape turns around with its back to you, as if hinting at you to keep caressing it.",
      "You eagerly dip your fingers into the ape's tummy. The fur there is so long and lush, as if it could swallow up all sorrow — even the black hole of Nihility pales in comparison. NL \"Heh-heh, my floofy tummy.\" The wary ape gradually throws all caution to the wind under your caress, lounging limply across the rock, allowing another primate to play with it.",
      "Distant cries of predators startle the ape away. The ~fluffy~ sensation lingers in your palm — next time, you should go pet the Oblivion Eagle.",
      "You sever your heart's desires with sheer resolution, in consideration of both your safety and the ape's mental health.",
      "Perhaps you accidentally touched its wound — or it is simply agitated — the ape brusquely leaps to its feet, bares its fangs, and bellows loudly in intimidation. NL Unable to dodge in time, the ape's nails are already lunging at you at a speed that the naked eye cannot catch.",
      "The sudden stimulus riles up the ape immensely, howling as it slaps away your hand, all its muscles tensed up. The sheer domination of nature, raw and without warning, emanates from its body. NL It furiously beats its chest, channeling a howl from its lungs, ready to mete deserved punishment on this unruly stranger.",
      "The ape disappears in the darkness. You should take comfort in the fact that it did not file an animal rights' violation complaint against you.",
      "You'll be caressing this fur today, whether the ape likes it or not!"
    ]
  },
  "HSRMod:ShoppingStreet": {
    "NAME": "First Battle of the Shopping Street",
    "OPTIONS": [
      "[continue]",
      "For the glory of humanity!",
      "Sorry, I didn't catch that.",
      "[Spicy candies] Gain 1 #yRare relic, gain 1 curse.",
      "[Numbing candies] Gain #y%s, gain 1 subtle relic.",
      "[Mumbling candies] Gain #y%d gold, gain 1 relic related to gold.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You sit cross-legged on the cushion as you lock eyes with the half-human half-snake shop owner. The excitement of the 99th Staring Contest is reaching its peak. Even the water demon's two drinking buddies can't help but cover their mouths, for fear they would disturb this world-shattering showdown. NL The lion-dog officer assigned to maintain order on the scene is nervously chowing down on dog food. Even the biker gang youth they cuffed under arrest is sweating over the contest.",
      "\"Give it up, young one. There are scant few in the Heavenly Kingdom of Eloquence — and fewer still in this Shopping Street — who can defeat me in this contest.\" The shop owner makes a threatening sound and her forked tongue almost touches your eyes.",
      "You're stubborn but you can feel your eyes becoming the desert of Planet Mio as they part ways with all water molecules. NL You widen your eyes, trying to hurt your opponent's pupils with your gaze. Two pairs of eyes protrude in the air like the finest ornamental goldfish, almost popping out of their eye sockets to collide with each other like meteorites.",
      "\"Gah, I surrender.\" The shop owner painfully closes her eyes. In that moment, every human and monster cheers for your victory. As this year's champion, you get the chance to be the first to taste all limited-edition products in the candy store!",
      "\"Hiss... Don't get too cocky now. There is always a stronger opponent,\" the shop owner laughs and flicks her forked tongue. \"I am the weakest among the Four Unblinking Kings.\""
    ]
  },
  "HSRMod:SelfAnnihilator": {
    "NAME": "Kindling of the Self-Annihilator",
    "OPTIONS": [
      "[continue]",
      "[Accept the flames] Gain 1 #yCurse, gain 1 #yRare relic.",
      "[Refuse] Gain #y%d gold.",
      "[Terminate the black box] Battle, reward: 1 #yRare card.",
      "[Reinforce this belief] Gain 1 #yCurse, upgrade #b%d #yErudition cards.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You step into a natural program simulated by the recursive formula and notice a black box on the ground. You open it to reveal the holographic image of a physician — he has the body of a serpent below his waist. NL His dark green scales rustle and reflect a metallic glint as he moves its tail. \"Hiss...\" He speaks. Thanks to the Synesthesia Beacon, you can slowly understand his language.",
      "\"Xuange was destroyed by Lan's Lux Arrow 62 light years away. Herta observed the incident and nurtured my spiritual form in the Simulated Universe.\" A kindling emerges in the physician's hands. NL \"My existence is Nihility... I do not have the authority to terminate the black box. I've tried to get out of the defensive walls, but I've only managed to send the self-extinguishing kindling outside the black box. I hope you can take it and see my belief through.\"",
      "You got the flames.",
      "You refused him."
    ]
  },
  "HSRMod:AhaStuffedToy": {
    "NAME": "Aha Stuffed Toy",
    "OPTIONS": [
    ],
    "DESCRIPTIONS": [
    ]
  },
  "HSRMod:KnightsOfBeauty": {
    "NAME": "Knights of Beauty to the Rescue",
    "OPTIONS": [
      "[continue]",
      "[Accept help from Stilott] Upgrade all #yRare cards.",
      "[Accept help from Abomins] Gain #y%d gold.",
      "[Accept help from Argenti] Gain #b%d #yPath cards.",
      "[Accept help from Will Garner] Heal #g%d HP.",
      "[Accept help from Pomaine] Gain #b%d relics.",
      "[Accept help from Anoklay] Remove all #pCurse cards (including unremovable ones).",
      "[Accept help from Holvisio] Gain 1 #yRare card from the current path.",
      "[Accept help from Galahad Icahn] Gain #y%s.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You have been stuck in the Mourning Cave for ages... You have become unkempt, with a weary look in your eyes. If anyone were to come and help you at this moment, you would see them as your salvation. NL As you are contemplating whether to save yourself by making an eye-catching sign as bright as the *Beacon Coloring Paste*, you hear an ancient and beautiful song - The song, as refreshing as the clear rain, soothes your soul like a pot of honey tea.",
      "\"It's our honor to meet a soul as tenacious as yours. We are the Knights of Beauty, and we'll show you our passion through our spears.\" Along with the clanking sound of armor, a burst of dazzling light envelops you... You hear the sound of a descending massive airship. While drifting in and out of consciousness, you can only vaguely hear them discussing how to rescue you...",
      "Yet... the discussion lasts for a very long time. They shower you with praises before introducing themselves. After analyzing your predicament, they provide you with dozens of targeted solutions... You find the situation more and more confusing, and you start to wonder whether they can be trusted.",
      "he knight offers you a flower. NL You receive it... The petals of Beauty melt your heart.",
      "The knight extends a hand to you. NL You grab that hand... The lingering body warmth melts your heart.",
      "The knight offers you a praise. NL You turn to him but pass out before you can see his face... When you regain consciousness, you are surrounded by the knights.",
      "The knight's long hair hangs down slowly. NL You catch a handful of long hair... and regret doing so.",
      "The knight gives you the round shield. NL You can feel the glory from the shields, and you are shaken by the valor of the knights.",
      "The knight extends a spherical hand to you. NL After assessing the position of its fingers... you hold its hand in the end.",
      "The knight calls to you fondly. NL You answer the call... The voice sounds very pious.",
      "The knight gives you a companion. NL Wow! You're riding a companion and swooping down from the sky!",
      "After rescuing you from danger, the Knights of Beauty are reluctant to leave. They consider you a devoted follower of the Aeons... NL A Knight of Beauty decides to teach you the spirit of Beauty. NL \"I hope you believe in Idrila,\" the Knight of Beauty says reverently.",
      "After rescuing you from danger, the Knights of Beauty are reluctant to leave. One of the knights thinks you are a fan of Curios... NL The knight gives you his Curio. NL \"I hope you're satisfied with my help,\" the Knight of Beauty says reverently.",
      "After rescuing you from danger, the Knights of Beauty stare at you with melancholic expressions... NL One of the knights thinks there are still \"problem\" on you, so he helps you to take away all curses. NL \"I hope you're satisfied with my help,\" the Knight of Beauty says reverently.",
      "After rescuing you from danger, the Knights of Beauty stare at you with melancholic expressions... NL One of the knights thinks you are unable to bear the weight of the Curios, so he replaces all your Curios with Cosmic Fragments! NL \"I hope you're satisfied with my help,\" the Knight of Beauty says reverently."
    ]
  },
  "HSRMod:TheReturningHeliobus": {
    "NAME": "The Returning Heliobus",
    "OPTIONS": [
      "[continue]",
      "[No crying if you lose] Enter a 4 turn battle with Cirrus, gain gold according to enemies slain",
      "[Leave] What can you do to me?"
    ],
    "DESCRIPTIONS": [
      "Dark-green flames engulf the Express. An extremely familiar, evil sneer booms out from the carriage, and the shimmering cold air makes the hairs stick up on the back of your neck. NL \"Long time no see, little bug. Didn't think I'd actually escape, did you?\" You look up to see Cirrus staring at you wide-eyed, angry and arrogant flames burning violently in those eyes.",
      "Who knows where this data came from. You always feel as though the simulated version is worse than the original. NL \"Remember what I said? Today, you will pay double for the insults imparted on me by the Nameless and the Xianzhou!\" shrieked the great heliobus hysterically."
    ]
  },
  "HSRMod:FalseFuture": {
    "NAME": "False Future",
    "OPTIONS": [
      "[continue]",
      "[Change my future] Change the boss and gain the \"#yTowat #yCards\".",
      "[Abandon the suspicious divination] Leave and gain #y%d gold.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "As you sit inside the dim tent, the white-haired diviner waves her hand, prompting the meandering colors to block out the clamor of the Dispo Night Market outside. Her dark eyes scrutinize you, seemingly peering into your fate. NL \"The future... Many long to behold it, but often rue the sight.\" Her breath is soft yet captivating, coiling around you like a deep-sea worm.",
      "\"Divination is nothing but deceitful tricks, but I am different. I hold the power to shape your destiny.\" Drawing a deck of Tawot Cards from her sleeve, she pulls out a stack and places them face up before you.",
      "\"With a subtle shift in perspective through 'riddles,' the world will alter its form around you.\" The woman offers a faint smile before vanishing into the music of the night market.",
      "\"You seem to harbor a strong yearning for the mysteries of the future. Perhaps one day you may become one of us.\" The woman offers a faint smile before vanishing into the music of the night market."
    ]
  },
  "HSRMod:ShoppingChannel": {
    "NAME": "Shopping Channel",
    "OPTIONS": [
      "[continue]",
      "Smack it.",
      "Kick it.",
      "[Donut] You can't verify whether the quality control is up to par.",
      "[Lotus] You can't verify whether the quality control is up to par.",
      "[Box] You can't verify whether the quality control is up to par.",
      "[Smash this TV!] Lose #r%d HP, gain #b2 relics.",
      "[Leave] You're not interested.",
      "Heal #g%d HP.",
      "Lose #r%d HP",
      "Transform 1 common card",
      "Transform 1 uncommon card",
      "Gain 1 relic",
      "Gain 1 curse",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You are in a pitch-black room. The television before you is showing an infomercial channel funded by the IPC Traditional Project Department. NL \"You're watching the Capital of Passion infomercial channel. Before we start, we'd like to respond to the complaints on the Casket of Inaccuracy lodged by our viewers. As you know, if the Casket of Inaccuracy is accurate, it should be called the 'Casket of Accuracy' instead... *crackle*...\" NL Static appears on the old television as the signals get weaker. Soon, you cannot even hear the sound clearly.",
      "You smack the television. Its screen flickers twice and returns to normal. NL \"Next, we'd like to introduce a pan-cosmic product from IPC.\"",
      "You kick the television, and a surge of pain shoots up from your toes — a button wedges between your flesh and your toenail. The television screen flickers twice and returns to normal. NL \"Next, we'd like to introduce a pan-cosmic product from IPC.\"",
      "\"A box of expired doughnuts. As the Capital of Passion has entered its 4th era, food can almost be preserved forever. Thus, the citizens are curious about how expired food tastes.\" NL \"A lotus that can sing the Happy Birthday song. As a feature in everyone's childhood, it appears countless times in people's dreams.\" NL \"A mechanical box. It looks like it didn't manage to get sold for over 200 years.\" NL You are lost in thought.",
      "You take a bite of the doughnut and feel your stomach churning...",
      "As the lotus starts singing, your childhood memories come flooding back. You seem to have traveled back in time to the previous era...",
      "You open the box and see something odd inside...",
      "The infomercial is addictive. You want to keep watching, but the screen suddenly turns off."
    ]
  },
  "HSRMod:GeniusSociety": {
    "NAME": "Mechanical City \"Cogito Hair Salon\" — Genius Society",
    "OPTIONS": [
      "[continue]",
      "Adjust Intra-Cognition",
      "[Pick a family element] Gain 1 random card, 1 random common relic, and #y%d gold.",
      "[Pick a family element] Gain 1 random card, 1 random common relic.",
      "[Pick a friendship element] Heal #g22 HP.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "\"Alright, everyone is here.\" Herta clears her throat and says, \"We've finally gathered at the Cogito Hair Salon in the Mechanical City, though it's just a simulation! Now, let's get a haircut. Oops, sorry, we've got to talk about something while getting our hair done.\"",
      "\"Affirmation: We need to constantly reaffirm our Intra-Cognition during our journey in the Simulated Universe,\" says Screwllum. \"(Trailblazer), we wonder whether your Intra-Cognition has changed during this wonderful trip. If your Intra-Cognition is swayed by the test, you'll see yourself as a machine, and that's not what we hope to see.\"",
      "\"Conclusion: Some memories have resurfaced.\" Screwllum smiles and sinks deep in thought. \"Once upon a time, when the organic and inorganic lives were not at odds, they would sometimes find themselves hardly distinguishable.\" He fishes out several components from his pocket. \"These are emotional components, and some of my machine friends reside within them. You can pick one as your souvenir.\"",
      "You gain what you want."
    ]
  },
  "HSRMod:CheatCode1": {
    "NAME": "Cheating Code (I)",
    "OPTIONS": [
      "[Take #y%d gold] No risk.",
      "[Take #b1 relic] Some risk.",
      "[Want both gold and relic] The old gambler appears.",
      "[You don't need this] This game cannot be started.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "\"Welcome to the city of St. Domingo! We sell cheat codes here.\" The mechanical attendant explains without a care in the world. \"The kind you were definitely crazy about when you were little. What we have is slightly different, as they are the St. Domingo version.\" NL \"Use it any way you want. Just make sure you don't get caught by the mechacops,\" it giggles.",
      "\" ~Good~ ~luck!~ \""
    ]
  },
  "HSRMod:CheatCode2": {
    "NAME": "Cheating Code (II)",
    "OPTIONS": [
      "[Forced to fight] You have no choice!"
    ],
    "DESCRIPTIONS": [
      "You are taking a stroll in the city of St. Domingo... Dazzling lights are everywhere. As you are mesmerized by the brilliance, someone taps on your right shoulder. You turn around in surprise, and your left arm is clasped the next second. NL \"Hello.\" A St. Domingo mechacop bows to you and says, \"Please come with me. Evidence: Your previous usage of cheat codes have been documented.\""
    ]
  },
  "HSRMod:MilkyWayRailroad": {
    "NAME": "Night on the Milky Way Railroad",
    "OPTIONS": [
      "[continue]",
      "[Express desire for wealth] Gain #y344 gold, but be cursed with #rMediocrity.",
      "[Regain confidence in life] Restore all HP.",
      "[Record this breathtaking view] Obtain #y「Night on the Galactic Railroad」.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "As you turn around, you see the Weather Wheel Pillar that had somehow transformed into a hazy triangular marker, flickering like #yfireflies~. NL NL Gradually, the lights of the Weather Wheel Pillar grow distinct, standing resolute and majestic at last, then rising straight and gallantly across the sky's wilderness like freshly forged #bsteel-blue plates.",
      "Suddenly, you hear an ethereal voice from nowhere: #b@\"Galactic Station, we've arrived at Galactic Station!\"@ NL NL At the same time, your vision floods with brilliance—as if the glow of ~hundreds of millions of bioluminescent squids~ had been crystallized into eternal fossils and cast into the #bsky; or as if someone had recklessly unearthed the #bdiamonds secretly stockpiled by mining companies to manipulate prices, scattering them across the ground with a ~clatter~.",
      "When you regain your senses, you realize the small train you're on has been speeding forward all this while. NL NL Indeed, you're now riding along a #pnighttime narrow-gauge railway, seated in a carriage lit by tiny #yyellow bulbs, admiring the scenery outside. The seats are upholstered in #bblue velvet but remain empty, while two large #ybrass buttons gleam brightly on the opposite gray-painted wall.",
      "Before your eyes, the world suddenly #p~shimmers with radiance~, forcing you to rub your eyes repeatedly in disbelief."
    ]
  }
}