{
  "HSRMod:StelleAwake": {
    "NAME": "Choose your path",
    "OPTIONS": [
      "[Elation]",
      "[Destruction]",
      "[Nihility]",
      "[Preservation]",
      "[Propagation]",
      "[The Hunt]",
      "[Erudition]",
      "[Abundance]",
      "[Remembrance]",
      "[Trailblaze]",
      "[Begin Journey]"
    ],
    "DESCRIPTIONS": [
      "",
      "~Are~ ~You~ ~Ready~ "
    ]
  },
  "HSRMod:RuanMei": {
    "NAME": "Ruan Mei",
    "OPTIONS": [
      "Who are you?",
      "Are you another puppet of Herta's?",
      "What is this place?",
      "[continue]",
      "What's the difference between your code and Herta's?",
      " Both of you like to pull off little tricks",
      "[Worship Aeons] #gUpgrade all cards",
      "[Want lots of money] Gain #y1200 gold",
      "[Steal goodies from Herta] Obtain #b6 relics",
      "[You are... Ruan Mei?] Trigger 2 effects above",
      "[LOCK] Needs A-Ruan Pouch. ",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You catch a whiff of the aroma of warm pastries. Your eyes fall on a bean pastry adorned with Startled Deer petals. NL You continue to trace the source of the aroma. As you look up, you find a dark-haired lady standing in front of you. You can smell the residual aroma on her lips while she licks the bits of pastry stuck on her fingers.",
      "\"I nurtured this miniature slice by myself and embedded it into the code of the Simulated Universe.\" She strokes the embroidery on her scarf distractedly as she adds, \"Don't tell Herta and Screwllum about this.\"",
      "\"Herta invited me to participate in this project and nurture the universe.\" She shakes her head. \"I'm different from her. Although we appear like the best of friends in many aspects... the truth is, we aren't that close with each other.\"",
      "\"This is the simulated lab, my miniature petri dish.\" She says with a frown.",
      "\"Herta has a thing for inventing quirky systems and gadgets, while I nurture the prototypes of the universe and the Aeons.\" She answers.",
      "\"The chance of breaching into my slice is slim, so you should be happy about this. I'll give you some things,\" she says, \"good things. But they don't come for free.\""
    ]
  },
  "HSRMod:CosmicCrescendo": {
    "NAME": "Cosmic Crescendo",
    "OPTIONS": [
      "[continue]",
      "[Listen] Trigger 10 random effects in a row.",
      "[Don't listen] Don't listen to bewitching songs...",
      "[Join the choir!] Trigger 15 random effects in a row.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "One day, a fan of a major rock star hands you a soundtrack album he has kept for a long time. There are dozens of different voices inside. NL \"The noisiest rock music, the most sacred classical rap, the trendiest retro elements, and the most vibrant basic musical ornaments! This precious album showcases the instrumental piece of cosmic trendy toys and food and the latest social deduction game, with a mixture of elements across the ages!\" NL Feeling annoyed, you are certain he is a member of the Contradictory Element Organization!",
      "You #ggained %d gold.",
      "You #rlost %d gold.",
      "You #ggained #y%s .",
      "You #rlost #y%s .",
      "Your %s has upgraded.",
      "Your %s has transformed.",
      "Your health is #gheal by %d.",
      "You #rlost %d health.",
      "Nothing happened.",
      "The song is over."
    ]
  },
  "HSRMod:IOUDispenser": {
    "NAME": "I.O.U. Dispenser",
    "OPTIONS": [
      "[I'll buy it] Gain Angel-type I.O.U Dispenser",
      "[I don't need it] Gain #y100 gold",
      "[Claim an investment] Gain Angel-type I.O.U Dispenser and destroy it.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Madam Scarred Eye, board member of the IPC, sits across from you. A long and narrow scar cuts through her left eye. You can sense her gaze on you, and you know she is not to be trifled with. NL You are sitting here because of her overwhelming intimidation. A maid offers her a glass of champagne, and softly kisses the back of her hand. NL \"The planet Evelli is hit by a financial crisis,\" Madam Scarred Eye announces. \"To help them tide over, our Business Consolidation Department has launched the Angel-type I.O.U. Dispenser. I'll make you an irresistible offer.\" NL \"Buy the IPC's debt, wait for this catastrophe to be over, and the IPC will pay you an amount more than ten times your principal.\" NL The servant next to Madam Scarred Eye pushes out a robot angel with wings. \"This is the Angel-type I.O.U. Dispenser. You need to feed Gold Coins into it regularly, and it will keep a record of your investment. At the end of the investment term, it will pay you an amount more than ten times your principal.\"",
      "~Thanks~ ~for~ ~coming~~"
    ]
  },
  "HSRMod:Tavern": {
    "NAME": "Tavern",
    "OPTIONS": [
      "[continue]",
      "[Expose his bankruptcy] Enter battle, gain a common relic after victory.",
      "[Expose him] Enter a harder battle, gain an uncommon relic after victory.",
      "[Fight both together!] Gain a rare relic after victory.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You reach an Elway-style tavern with a lively atmosphere. NL You order a cocktail concocted with Marian oranges and palm cinnamon. Then, you observe the crowd. Everyone is wearing a mask and has different body sizes. From this, you know it is a tavern where the Masked Fools gather. NL \"Welcome to Tavern World's End.\" Bragi, the bartender, bows deeply to the patrons and continues, \"We only serve customers with a sense of humor.\"",
      "\"In keeping with Aha's will, we will have some fun next. Mr. France and his team of bodyguards will be the next to join the arena. His opponent will be Avila. He and his mercenaries are burly and not to be underestimated!\" NL \"Who else is coming? Who's up for the 78,201st round?\"",
      "You #ywon."
    ]
  },
  "HSRMod:RockPaperScissors": {
    "NAME": "Rock, Paper, Scissors",
    "OPTIONS": [
      "[continue]",
      "[Fight for the 0.63% chance] #rEnter #rbattle",
      "[Pick the 100% security] Lose #y100 gold",
      "[Sense the vulnerabilities] #rEnter #ra #rharder #rbattle, gain one more card reward and upgrade them.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "The astral computer before you, with a curved screen on top and a genderless human body at the bottom, is running a calculation at a high speed. While it seems to be simulating the collapse of a massive star, only you know that you are playing a game of rock-paper-scissors with it. NL \"There is an 82.49% chance of you playing rock in the first game, and a 94.61% of you playing scissors in the second. ",
      "If you choose to flip the table with me and battle with the monsters I created, there is a 99.37% of you losing.\" NL \"But if you leave some Cosmic Fragments behind, your chance of survival is 100%.\" It is waiting for your response.",
      "You left some gold behind.",
      "You #ywon."
    ]
  },
  "HSRMod:WaxManufacturer": {
    "NAME": "Sealing Wax Manufacture Machine",
    "OPTIONS": [
      "[Wax Blessing] Get a card from all uncommon cards of current path",
      "[Purchase Wax] Get a more suitable wax.",
      "[Wax Enhancement] Upgrade #b3 cards of current path",
      "[Wax Casting] Gain a suitable path relic",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You look at the scene before you: It is raining in the Black Forest, and there are dew drops on every leaf. The rain saddens you. NL You wander around in the Black Forest amid the drizzle and arrive at a blacksmith's store by the roadside. A machine is immersed in churning out sealing wax and hammering away in full concentration until your presence interrupts its work. NL \"Do you want to ask me about the sealing wax?\" It has a penetrating gaze.",
      "\"I'll still be making sealing wax here for another 100 years,\" the manufacturing machine says, and then gets back to its hammer.",
      "Select a card to obtain"
    ]
  },
  "HSRMod:LonelyBeautyBugsOne": {
    "NAME:": "Loneliness, Cosmic Beauty Bugs, Simulated Universe (I)",
    "OPTIONS": [
      "[continue]",
      "[Feed salt nack] #rlose #b1 random non-starter relic",
      "[Use cleaning foam] #rlose #b1 random card",
      "[Feed milk tea] Lose #y100 gold",
      "[Take care] This is how you treat your friends.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Despite having traversed the Simulated Universe for eight million miles, you did not find anyone who truly understood you... NL You are tired of continuously testing one project after another. So, you decide to adopt a worm as your companion in the Simulated Universe.",
      "ou observe your companion: This beautiful space worm is named Sweet Saliva. It secretes secondary metabolites around its wound that give off a unique flowery, fruity, and sweet scent... You know that when it matures, it will linger around the exotic fruit orchards and cosmic tea plantations. Each of its trips may bring the scent of *love* to you. NL Although you are destitute... you can still do your best to nurture it.",
      "Your space worm wriggles and spurts a mouthful of saliva at your face to show its gratitude to you. NL Oh... You feel so happy!",
      "Your space worm is wriggling. You wait for it to spurt a mouthful of saliva at your face... NL However, it leaps and smacks its tail against your face instead! It hurts a lot! NL ...Seems like it hates to be treated this way."
    ]
  },
  "HSRMod:LonelyBeautyBugsTwo": {
    "NAME:": "Loneliness, Cosmic Beauty Bugs, Simulated Universe (II)",
    "OPTIONS": [
      "[continue]",
      "[Accept the \"Heartfelt Gift.\"] Obtain #b3 random common relic",
      "[Accept the \"Life's Favor.\"] Obtain #yOrrery",
      "[Accept the \"Life's Favor.\"] Obtain #b1 random #rboss relic",
      "[Refuse] You just want to keep giving... You don't expect anything in return at all.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Time flies. The space worm named Sweet Saliva that you have nurtured has been undergoing immersive learning at the cosmic tea plantation for a long time... When you hear the sound of fumbling at the door, you know it is back. NL You open the door and find that it has grown up. Its skin, which was initially green, has faded and is now covered by a colorful pattern that is a mixture of white, yellowish green, and brownish blue hues...",
      "They are the signs that Sweet Saliva has matured into an adult bug. It calls out for you... which is the proof of its *love* for you.",
      "A relieved and sorrowful smile breaks out on your face."
    ]
  },
  "HSRMod:SlumberingOverlord": {
    "NAME": "Swarm: Slumbering Overlord",
    "OPTIONS": [
      "[continue]",
      "[Leave immediately] Lose #r20% health",
      "[Kill them] Enter #rbattle, gain Intersection Membrane",
      "[Tidy things up] Enter #rbattle, gain Excitatory Gland",
      "[Offer spore sacks] Get a Curse, get Plague Nest",
      "[Get your loot]",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Holding a syringe containing Metabolase, you stride toward the putrefied throne slowly and nervously... All it takes is a tiny dose deliver into the Swarm's fibers and...",
      "You pierce it with the needle! NL The dose wakes the Lord of Eternal Slumber up! It opens its eyes wide and starts drooling...",
      "\" @...█Hiss...██...█Hiss█...██...@ \"",
      "You know metabolism takes time... and you want to witness its completion! However, more and more Swarm larvae are coming! You must escape from them quickly...",
      "You #ywon.",
      "You offered your spore sacks to the lord.",
      "You obtained your loot."
    ]
  },
  "HSRMod:DoubleLottery": {
    "NAME": "The Double Lottery Experience",
    "OPTIONS": [
      "[continue]",
      "[Vote] Purchase a lotto relic using #y50 gold, and fix all lottos",
      "[Experience] Fix all lottos using #y25 gold",
      "[Refuse] You can't find happiness like that!",
      "[Hack] Destroy all the lotto, gain relic twice of lotto destroyed",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "he lottery distributor from the Interastral Peace Corporation's Fanaticism Department is here! NL \"Have you heard of the Double Lottery Experience?\" He whispers into your ear.",
      "\"I can provide you with... the Double Lottery Experience... as long as you vote for Oswaldo Schneider in the election.\" NL He looks at you with anticipation in his eyes.",
      "I want to vote for \"Oswaldo Schneider\"! NL You shouted",
      "I want to have the Double Lottery Experience! NL You shouted",
      "You refused the distributor's offer.",
      "You hacked into the \"code\" of the lotto series"
    ]
  },
  "HSRMod:ThreeLittlePigs": {
    "NAME": "Three Little Pigs",
    "OPTIONS": [
      "[continue]",
      "[Play a bit with Sequence Trotters] Enter combat with 3 #ySequence #yTrotters — Trot Prime, Trot Deuce, and Trot Tri.",
      "[Leave] A person shouldn't be on the same level as Trotters!",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "Three timid sequence creatures that resemble a pig bump into you as you wander across the wilderness where the Hithradahn people dwell. They react differently to your presence: one is trembling, one is ready to flee, and one is in a combat position.",
      "You remember the description written in the Interastral Peace Guide. The creatures are called Sequence Trotters, and they are trans-latitudinal organisms. They spend most time of their lives eating and escaping. NL Running into a Sequence Trotter is an auspicious sign. You start to think of a way to deal with them. The rules of the game must be fixed according to the personality of each Trotter.",
      "The trotter catching game ended."
    ]
  },
  "HSRMod:ImperialLegacy": {
    "NAME": "Imperial Legacy",
    "OPTIONS": [
      "[continue]",
      "What happened next?",
      "Who is he?",
      "[Touch] There is a very low chance of receiving a response from the legacy.",
      "[Embrace] Gain 1 random #yRubert #yEmpire series relic.",
      "[Accept] Spend #y300 gold and gain 2 random #yRubert #yEmpire series relics.",
      "[ #bReturn ] Lose Rubert Empire Difference Machine. Obtains #y2400 gold, #y24 random relics, and upgrade 24 cards.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You find yourself on a nameless planet full of towering metallic structures. Among the ruins basked in faint sunlight, a massive, sophisticated machine slowly makes its way toward you. It picks up the parts scattered all over the ground and fixes them onto its fortress-like body in an orderly manner.",
      "The piston rises and falls, resulting in a vigorous lever effect that brings about the turning of the gears. The machine emits a deep growl as it mends its damaged body with little hope of completion.",
      "An old man approaches you with one-half of his arm drooping. The ancient Intellitron is unfazed by the peculiar scene before him. Using his last piece of visual crystal he has, he fixates his gaze upon you, an unexpected visitor, and nods approvingly.",
      "\"How nostalgic. Once, there was also an organic creature like you standing here, marveling at the lives created by the emperor.\"",
      "\"How could I possibly remember?\" The ancient Intellitron shakes his head, and a string of chewed cables falls out along with several oxidized chips engraved with the crest of the Rubert Empire. \"They say I'm broken, just like this kid here.\"",
      "The dreadful steel fortress comes to a halt behind the old man. Its gears grind against each other non-stop, producing an odd noise. It seems to be responding to the old man's commands.",
      "\"The emperor's legacy isn't only available for inorganic creatures. If you can free yourself from your current shackles... it will guide you in the right direction.\" A faint crimson light flashes in the Intellitron's eyes. His words send ripples of resonance in your consciousness like a spell.",
      "The battered moving fortress glides past the top of your head. Your heart almost stops beating because of the enormous roar.",
      "By the time you snap out of your trance, the ancient Intellitron has gone far with the machine, leaving behind tire tracks on the ground.",
      "The colossal metal behemoth has not responded to your expectations. However, there is no need to rush because one day, the successor to the Empire will come here.",
      "A grand formula unfolds in your mind. Cold data permeates your perception, waiting for subtle changes to take place in the future.",
      "The old man takes a part from the metal behemoth. The part moves closer to the rest of the parts surrounding you in apparent eagerness. Amid their resonance, you seem to discern the lingering voice of the Emperor Rubert.",
      "The old man takes two parts from the metal behemoth and hands them over to you solemnly. A plethora of equations alters your cognition, their intense reverberations causing your head to split.",
      "The old man stares at you blankly, his obsolete logic chip unable to comprehend your actions. With his hands trembling, he takes the difference machine from you, looking just like an ordinary, despondent citizen of a fallen kingdom."
    ]
  },
  "HSRMod:PineappleBread": {
    "NAME": "Pineapple Bread",
    "OPTIONS": [
      "[continue]",
      "[Choose Pineapple] Choose to remove #b3 cards, but gain negative relic: Pineapple.",
      "remove 3 cards",
      "[Choose Bread] Nothing happens.",
      "[Take a drink] Obtain #b2 random subtle relic.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You sit on the hot sofa as the lights make you temporarily dizzy. The game of bravery: Pineapple Bread is approaching its final stages as everyone awaits your decision as the final survivor. NL NL \"There are two boxes left. Eat the pineapple and take the prize or eat the bread and get lost.\" The manic faces of the audience are reflected in the host's compound eyes — They don't want to see you win. They want to see you fail.",
      "There are over nine thousand objects in the cosmos that go by the name of \"pineapple.\" Some are rocks, some are leaves, and some are even black holes. Until you open this box, no one knows what lies within. NL NL Your brain freezes as images of the last runner-up being evaporated by a plasma pineapple rush through your mind.",
      "\" #y@Pineapple@ or #y@bread!?@ \" The spectators impatiently spur you on.",
      "One doesn't get rich without taking risks! As you swallow the pineapple, a bitterness runs over your tongue.",
      "You become deeply aware of a great truth: That no matter how much money you have, you have to be alive to spend it.",
      "This program is sponsored by the Interastral Peace Corporation. Authentic pineapple soda, bringing you an unforgettable feast of flavor."
    ]
  },
  "HSRMod:TrashSymphony": {
    "NAME": "Trash Symphony",
    "OPTIONS": [
      "[continue]",
      "[Never turn my back on humanity] Enter a battle against trashcans, gain #b2 relics after victory.",
      "[I am the king of trashcans!] Enter battle against Rumbas the Third, gain #b2 destructible relics after victory.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You enter the underground stronghold of the Rumbas system. A large number of weapons and trashcans fall from the production pipeline. Rumbas the Third rides atop his horse, displaying his authority that rivals Tatalov, undiminishing and ever-burgeoning. NL NL For a long time, trashcans have endured unequal treatment. They are treated as mere tools of humanity, devoid of dignity. NL NL Rumbas the Third raises his arm and shouts. He demands power, power to freely access organic and recyclable waste. He vows to lead an army of trashcans to dominate the universe and become the master of all realms.",
      "Rumbas the Third's gaze falls on you. \"The hero who defeated Tatalov... You are different from other inferior humans. I will give you a chance.\" NL NL Will you kneel before Rumbas the Third and accept the emperor's honors, or swear loyalty to the human race to which you belong and continue to oppress the trashcans?",
      "Rumbas the Third respects your choice. He fakes his sadness as he summons his cloned trash kin, instructing them to give you a \"dignified\" end.",
      "A mere trashcan dares to order you around? You swing your bat and charge at Rumbas the Third, ready to snatch this emperor's perch.",
      "You #ywon."
    ]
  },
  "HSRMod:AceTrashDigger": {
    "NAME": "Ace Trash Digger",
    "OPTIONS": [
      "[continue]",
      "[Even trash has its unique \"value\"...] #yGain #b3 destroyed relics。",
      "[Toss your trash in!] #rLose #b1 normal relic， #yGain #b2 random relics.",
      "[leave] You are not interested the trashcans.",
      ""
    ],
    "DESCRIPTIONS": [
      "A person carrying a trashcan meets you. He crouches down and shows you his treasured trashcan. NL NL \"This is an incredulous space.\" He beckons. Then, he tosses out some collections of pitiful love poems from the trashcan to make some space for you. NL NL In a hushed voice, he says, \"Put your waste in it, and the items will evolve into an advanced awareness, then come running out energetically on their own!\"",
      "Who can deny a brand new Trash?"
    ]
  },
  "HSRMod:CulinaryColosseum": {
    "NAME": "Culinary Colosseum",
    "OPTIONS": [
      "[continue]",
      "[Come at me all at once] Enter battle, gain #b2 random relics after victory.",
      "[Throw trash into the opponent's can] Enter battle, remove #b2 cards after victory.",
      "[Challenge the jury] Enter battle, gain #b3 destructible relics after victory.",
      "[Claim reward]",
      "[leave]",
      "Choose to remove  cards"
    ],
    "DESCRIPTIONS": [
      "Walking into the recycling station on the Rumbas system, you hear thousands upon thousands of trash dumps cheering from inside the garbage pile. NL NL As ring master of the 21st Garbage Chef Championship, you view the observation shield, half-eaten Halovian Winged Burgers, currency from an unknown system, as well as the garbage thrown from the audience instead of flowers, as an expression of their hopes for you.",
      "You casually glance around at the challengers: Tatalov's palace chef, Erolyn, the molecular eater Risaac, who's tasted a thousand kinds of garbage, and the world-famous garbage gourmand Jacques Feaux. Every one of them is a demanding prospect. NL NL And yet, in your mind, the menu for victory has already been decided.",
      "You've got guts! After hearing what you have to say, three fighters get ready to fight and decide to express their respect for you at the highest level.",
      "\"Whoa... boo!\" jeer the audience as the challengers grow furious, preparing to teach you a lesson.",
      "\"Wow, what an arrogant youngster.\" Several referees jump forth, and the audience wipe their lids clean — preparing to witness an epic showdown in the world of garbage cuisine.",
      "You #ywon.",
      "You got what you deserved."
    ]
  },
  "HSRMod:YuQingtu": {
    "NAME": "Genius Society #55 Yu Qingtu",
    "OPTIONS": [
      "[continue]",
      "Add sugar.",
      "Add toothpaste.",
      "[Elation] You decide to add more weird stuff to it...",
      "[Nihility] A glass of wine should learn to swirl itself.",
      "Stir gently...",
      "Stir vigorously!",
      "Give in to the sleepiness...",
      "First, take care of the unfriendly eyes around you!",
      "[Deal with the mutant] Enter battle, and gain 1 rare card after victory.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You arrive at a strange restaurant in outer space. In the building built with red bricks, there are some Bavirus, foxians, and humans. There is even a Diting sitting at a long table. NL NL Yet, some exiles dressed in gray prisoners' robes are here too... The sight of the shackles on their feet makes you shudder. You bypass them and walk to the bar with its comparative safety.",
      "\"We specialize in exotic cocktails.\" The waiter speaks in an odd tone. \"Out of all the cocktail recipes left by Genius Society #55 Yu Qingtu, only 25 of them have been passed down to this day. Three of them are available here, but we can't guarantee whether those involve her toxic concoctions. Which one would you like?\" NL NL You start to doubt the waiter's professionalism.",
      "It's time to stir it.",
      "You receive a glass of cocktail! You gulp it down...",
      "Your cocktail explodes in front of you! NL NL You gain nothing, in addition to being blasted out of the restaurant by this strong force.",
      "You're badly injured.",
      "You receive a glass of cocktail! You gulp it down... Soon, a wave of lethargy hits you. NL NL As you are feeling drowsy, you notice a mischievous *thief* sizing you up slyly from the other end of the long table... She seems to have no qualms about openly showing her evil intentions.",
      "You fail to resist the urge to sleep... By the time you wake up, the thief with her dazzling eyes is already gone. NL NL Your wallet is no longer stuffed, and you have lost lots of Cosmic Fragments... You hope to run into her again.",
      "You have finished stirring your cocktail. A lady in a sequined dress with a sensuous gaze suddenly walks over. The gems on her earrings sparkle under the lights, and you are bedazzled. She grabs the cocktail from your hands but still waves at you with a provocative smile. NL NL While you are still experiencing outrage at her action, she suddenly lets out a shrill cry, and her body curls up in a horrifying manner... You stagger a few steps backward.",
      "You are shocked by the recipe of Genius Society #55, Yu Qingtu. As it turns out, you have made a legendarily toxic cocktail...",
      "You #ywon."
    ]
  },
  "HSRMod:IPMBShoppingMall": {
    "NAME": "Interastral Peace Mechanical Branch Shopping Mall",
    "OPTIONS": [
      "[continue]",
      "Ambergris Cheese",
      "Casket of Inaccuracy",
      "Fruit of the Alien Tree",
      "Level up your Cognition",
      "Recycle all items above with 200 gold each.",
      "[leave]"
    ],
    "DESCRIPTIONS": [
      "You arrive at the docking bay of the Freon Mechanical Alliance. It is a vast harbor with mechanical attendants everywhere. NL NL A mechanical attendant leads you up a staircase, which you notice is formed by numerous mechanical arms. You keep going until you leave the harbor and see the sign of \"Interastral Peace Mechanical Branch Shopping Mall.\"",
      "The place is renovated in a style very much iconic to the IPC... You walk up to the counter. NL NL \"We sell our stuff cheaper at the port. That's it.\" The mechanical staff doesn't bother to explain too much — a signal for you to make your own choice.",
      "You gained what you want."
    ]
  }
}